
public class Method01 {

	public static void main(String[] args) {
		
		// 메써드 4가지 모든 프로그램 공통
		
		// 1. void method1() : 매개변수 없다. 
		// 2. void method2(매개변수...) : 매개변수 존재.
		
		// 앞에 보이드 있으면 메써드 단순히 실행하고 
		// void 존재하면 실행 후 종료
		
		// 타입이 존재하면 반드시 return 필요
		
		// 3. 타입 method3() : 타입과 일치하는 return 값 존재
		// 4. 타입 method4(매개변수...) : return 필요, 매개변수 존재 (랜덤 함수)
		
		// 2번과 4번이 가장 많이 쓰인다.
		
		// 5. 재귀 함수
		
		// 퍼블릭은 공공 클래스, 스테틱은 메인이 스테익 영역에 존재
		// 메소드는 클래스 안에, 메인 메소드 밖에 위치
		// 재사용성 높히고 모듈화를 가능하게 한다.
	}

}
